Revit 2024 API
ParameterTypeId.StructuralFoundationThickness Property
 "Foundation Thickness"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StructuralFoundationThickness { get; }
Visual Basic
Public Shared ReadOnly Property StructuralFoundationThickness As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructuralFoundationThickness {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace